MICLARO-BACK-master/Servicios/M3/Hogar/ListarAgenda/template/request.php

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:clar="Claro.SelfCareManagement.Services.Entities.Contracts" xmlns:clar1="http://schemas.datacontract.org/2004/07/Claro.SelfCareManagement.Services.Entities.Messages">
   <soapenv:Header>
      <clar:HeaderAutenticacion>
         <clar1:contrase単aAutenticacion>Mi$.$16*$1CLARO$</clar1:contrase単aAutenticacion>
         <clar1:tipoCanalID>1</clar1:tipoCanalID>
         <clar1:usuarioAutenticacion>MiClaro*$.$2017</clar1:usuarioAutenticacion>
      </clar:HeaderAutenticacion>
   </soapenv:Header>
   <soapenv:Body>
      <clar:LoginUsuarioRequest>
         <!--Optional:-->
         <clar:loginUsuario>
            <clar1:contrase単a><?=htmlentities($Vqhzkfsafzrc->clave)?></clar1:contrase単a>
            <clar1:nombreUsuario><?=$Vqhzkfsafzrc->nombreUsuario?></clar1:nombreUsuario>
         </clar:loginUsuario>
      </clar:LoginUsuarioRequest>
   </soapenv:Body>
</soapenv:Envelope>